<template>
<div id="intro">
    <HeaderBody/>
    <div class="t-l">
      1984年8月中旬的一天，我出生在了甘肃腾格里沙漠边缘的一户农家。小时候就调皮捣蛋，乖张不已。小学就在离家不远的蔡寨小学糊弄的。小学的生活也许是这一生中最为惬意和快乐的了。童年时光是最美好。至今也无法忘却那些和小伙伴们捅天捣地的日子，想念每一张快乐的脸蛋。<br>

1997年开始初中生活。初中的生活过得比较的傻，我只能用这样一个字来形容。因为我初中就是在学习了。虽然曾一时想去穿越一下家乡旁边的腾格里大沙漠，但最终还是在其他同学家长的威吓之下取消了计划（我父母还是很开明的，感谢我父母对我的信任）。规规矩矩，一改了小学的乖张气焰。终于考到了市一中，但还不是重点班。有点失败阿！<br>

2000年步入高中。高中生活是我人生中比较重要的一个开始，也是我城市生活的开始。第一年还是规矩了一年，成绩可以也没有什么大的意外。第二年的我开始迷恋武侠小说，看完了金镛看古龙。到高三三次模拟考试，我都是匆匆答完试卷就猛奔出考场去看了。最后还是到了西邮，还是很幸运的阿！<br>

2003年考入西邮。大学生活有点忙乱，大一迷茫了半学期，一半自己。大二开始学习web技术，并且给学校学工部创办了“西邮在线”网站。这个网站至今还在学弟们的手中继续者，并且和自己同班的同仁们（一共四个人）创建了班内第一个工作室（Dim4 Web Studio），并陆续接手学校党委,系学生工作网的建设和维护。与此同时接受外校的学校网站的建设。并合作开发了自己的CMS，我主要重写了所有的新闻接口和数据接口。使得系统使用更灵活方便。<br>

并且担任班内的英语学习委员，为班内同学服务了两年(大学英语只学习两年).<br>

2007年5月考入西安邮电学院计算机系研究生，并开始研究生阶段的第一个横向项目（一个微波网管系统）。主要完成了硬件电路板的软测，在ZLG移植UCOSII的基础之上完成了LPC2214上的移植，并将原有的51c程序移植到LPC2214的UCOSII上，由于系统是双CPU双OS的，所以在前期工作完成后，后期我又转向UClinux系统的移植和其中串口程序的编写，并且编写的虚拟网卡驱动，完成网卡数据到串口的转发。最后做了对整个系统的测试工作<br>
    </div>
    <FootBody/>
</div>
</template>

<script>
import HeaderBody from './common/header.vue';
import FootBody from './common/foot.vue';

export default {
  name: 'mymain',
  components: {
    HeaderBody,
    FootBody
  }
}
</script>